posts/scratch/mutation_operators.tex
% Created 2019-03-30 Sat 23:09
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{listings}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.14)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{What makes for a good mutation operator?}
\label{sec:org2fe87d5}

\subsection{background}
\label{sec:org7af4ac7}

From [\url{https://arxiv.org/pdf/1203.3099.pdf}]:

\begin{quote}
Mutation prevents the algorithm to be trapped in a local minimum. Mutation plays
the role of recovering the lost genetic materials as well as for randomly
disturbing genetic information. It is an insurance policy against the
irreversible loss of genetic material. Mutation has traditionally considered as
a simple search operator. If crossover is supposed to exploit the current
solution to find better ones, mutation is supposed to help for the exploration
of the whole search space. Mutation is viewed as a background operator to
maintain genetic diversity in the population. It introduces new genetic
structures in the population by randomly modifying some of its building blocks.
Mutation helps escape from local minima’s trap and maintains diversity in the
population. It also keeps the gene pool well stocked, and thus ensuring
ergodicity. 
\end{quote}


\subsection{conjectures}
\label{sec:org37bcbfa}

\subsubsection{they should form a cyclic group under concatenation}
\label{sec:org2f8e158}
\subsubsection{they should cover the genotype space as well as possible}
\label{sec:org11a4995}
\end{document}